{
  "aboutSelf": {
    "name": "Robert \"Rex\" Beatie",
    "publicName": "Rex",
    "location": "Portland, OR",
    "email": "rex@xer0rex.com",
    "phone": "+15035067278",
    "skills": [
      "REST APIs",
      "HTTPS",
      "Web Application Message Protocol",
      "WQTT",
      "media streaming",
      "media players",
      "transcoding",
      "video",
      "sms",
      "chat",
      "VoIP",
      "bots",
      "Twilio",
      "authorization and authentication",
      "SSO",
      "SAMLv2",
      "encryption",
      "end to end encryption",
      "WebTokens",
      "JavaScript",
      "TypeScript",
      "GoLang",
      "PHP",
      "Python",
      "Java",
      "Cascading Style Sheets (CSS)",
      "JSS",
      "ReactJS",
      "React Native",
      "Expo",
      "Crosswalk",
      "Angular 2",
      "jQuery",
      "content management systems",
      "customer relation managers",
      "web components",
      "HTML5",
      "HTML",
      "markdown",
      "progressive web applicatoins",
      "single page applications",
      "aggressive caching",
      "static site generators",
      "image editing",
      "GIMP",
      "object relational mapping (ORM)",
      "document mapping",
      "interpolation",
      "automation",
      "crawlers",
      "continuous integration and continuous deployment",
      "Cascading Style Sheets (CSS)",
      "JSS",
      "jankfree web animation and view transitions",
      "parallax scrolling",
      "artificial intelligence",
      "task runners",
      "preCSS processing",
      "machine learning",
      "image and object classifiers",
      "natural language processing",
      "Firebase",
      "GoogleCloud",
      "Amazon Web Services",
      "data mining",
      "sql",
      "no-sql",
      "Search Engines",
      "reverse engineering",
      "code analysis",
      "queue systems",
      "ticketing systems",
      "GUI development",
      "Internet of Things",
      "drone flight controller integrations",
      "metric gathering",
      "logging systems",
      "payment gateways",
      "shopping carts",
      "documentarian",
      "technical writing",
      "live typography guides",
      "whiteboarding",
      "UML",
      "Web 2.0",
      "Web 3.0",
      "CLIs",
      "ASCII Art"
    ],
    "links": [
      {
        "type": "profile",
        "text": "inkedin.com/in/rdev-software",
        "url": "https://inkedin.com/in/rdev-software"
      },
      {
        "type": "repo",
        "text": "github.com/rbeatie",
        "url": "https://github.com/rbeatie"
      },
      {
        "type": "repo",
        "text": "github.com/rdev0rigin",
        "url": "https://github.com/rdev0rigin"
      },
      {
        "type": "portfolio",
        "text": "codepen.io/RDev",
        "url": "https://codepen.io/rdev-rocks"
      }
    ]
  },
  "summary": [
    "10 years of experience in the industry starting with website design and computer graphics. A vetted web developer and technical support engineer of 6 years working with top industry teams to diagnose and fix outstanding problems. Skilled in assessing concerns and modeling systems that were not directly visible as a technical support lead where understanding a customer’s preference for communication was critical to providing and meeting the customer's expectations.",
    "Being on a team and volunteering with mentorships forced me to discover ways to share ideas with others which have helped me gain a critical eye for code examples and the different forms of guides and developer documentation. Seeing different ways that we all learn has always taught me as well, how to better my process to account for new dynamics. As an engineer at heart I can feel friction when pulling myself away from interesting problems, however investing time in developing infrastructure is core to making what you couldn’t know, suddenly possible."
  ],
  "workHistory": [
    {
      "companyName": "Freelance (Sole Proprietor) - Web and Mobile Software Consulting and Engineering",
      "logo": "#",
      "positionTitle": "One Dev Operation",
      "dates": ["Dec 2018","April 2021"],
      "description": [
        "A revival of the freelancing and volunteer work I was doing up until the end of 2018, working on projects for friends and private clients. I also do bids on various platforms for a mix of short term work. Most of which are building front end elements in JavaScript and Twilio communication integrations, like chat, sms, and VoIP within web apps."
      ],
      "link": "https://twilio.com"
    },
    {
      "companyName": "Twilio",
      "logo": "https://en.wikipedia.org/wiki/Twilio#/media/File:Twilio-logo-red.svg",
      "positionTitle": "Principle Technical Support Engineer (L4)",
      "dates": ["Dec 2018","April 2021"],
      "description": [
        "As a leader on the Flex Support team, I helped build our support team and trained them and our customers in all things relating to Twilio Flex. Initially hired to trailblaze development on the internal and public processes used by others to ramp up with Twilio’s new product, Flex. I was a lead product support engineer and handled customer support tickets. Our customers ranged from single developers to engineering teams for globally recognized companies and groups in the private and public sectors. The product became wildly popular with a growing customer base with a company that had more than 250,000 active accounts.",
        "Handling Flex tickets required a deep understanding of web development HTTPS, REST APIs, ReactJS, and cross-knowledge of Twilio's products which totaled about 20 at the time. My tickets tended to relate to CRM integrations, SSO or Messaging and Chat that had me constantly testing our REST APIs and tracking down message samples through the different networks and logging systems.",
        "Flex provides omni-channel communication with two prebuilt ReactJS web components. This made custom code a common factor that can be time-consuming to support. I approached this concern by building generalized code examples so to be reused with things like documentation or macros for other tickets. I gave ideas for leveraging machine learning with my support managers and helped to build public-facing tutorials and step-by-step instructionals with the docs team contributing to Twilio's exceptional self-service experience.",
        "Developers and engineers were the majority of our ticket owners requiring that I was up to date with current building practices and common CRMs with complex ones needing a screen sharing or call to guide configurations or give code assessments. In short I provided closure to customers through informed empathy and being their advocate through the stressful process of finding their solution."
      ],
      "link": "https://twilio.com"
    },
    {
      "companyName": "DigitalOcean",
      "logo": "https://en.wikipedia.org/wiki/DigitalOcean#/media/File:DigitalOcean_logo.svg",
      "positionTitle": "Contractor - Developer - Standard Writer",
      "dates": ["Apr 2018","May 2018"],
      "description": [
        "I worked as an assistant developer for the lead editors with the goal of building a prototype that would win a budget for the project. The project was started using HUGO and I was responsible for providing aesthetic and functional customizations to the site and setting up a CRM. Our team's endeavor ended in success and the project became the beginning design and template for Digital Oceans product docs."
      ],
      "link": "https://digitalocean.com"
    },
    {
      "companyName": "PushP0P <LaunchCode Incubation> ",
      "logo": "https://en.wikipedia.org/wiki/Twilio#/media/File:Twilio-logo-red.svg",
      "positionTitle": "Software Engineer",
      "dates": ["Jan 2018","Mar 2018"],
      "description": [
        "An aspiring team of software engineers, designers, and future leaders. Developing progressive web apps and information systems while building a solid network and professional experience."
      ],
      "link": "https://github.com/PushP0P"
    },
    {
      "companyName": "Mumba Cloud",
      "logo": "",
      "positionTitle": "Front End Engineer",
      "dates": ["Aug 2016","Feb 2017"],
      "description": [
        "A member on a small SCRUM team building a cross platform UI hosted on the cloud for enterprise personal systems. My main responsibilities was to build using TypeScript, Angular 2 components to spec from design mockups. Using the same code style and design patterns my lead would set making sure our code looked unified. Attended daily scrum meetings where we could share our day and support each other.  I would sometimes work on the back end and had also worked on their typography guide."
      ],
      "link": "https://www.mumba.cloud/"
    },
    {
      "companyName": "Code For America",
      "logo": "",
      "positionTitle": "Volunteer - Technical Director of Infrastructure - Project Lead",
      "dates": ["Aug 2016","Feb 2017"],
      "description": ["A weekly volunteer member of a mentorship support network for coding and career guidance with the Portland, Oregon tech community."],
      "link": "https://codeforamerica.org/"
    }
  ],
  "Awards": [
    {
      "title": "1st Place Award - Team Awesome",
      "awarder": "Women Who Code - IoT Hackathon for Sustainable Futures",
      "date": "2017",
      "description": "Role: leading the development for the front end and deploying a telemetry API also helped to orchestrate team tasks, responsibilities and timelines." 
    }
  ],
  "education": [
    {
      "nameOfInstitution": "freeCodeCamp.org",
      "dates": ["2017","2017"],
      "focus": "Web Page Development, Digital/Multimedia and Information Resources Design",
      "acheivments": [
        {
          "name": "Front End Development Certification",
          "type": "Certificate",
          "date": "Oct 2017"
        }
      ]
    },
    {
      "nameOfInstitution": "LaunchCode",
      "focus": "Computer Software Engineering",
      "acheivments": [
        {
          "name": "iEatWhat - Alergies Friendly Meal Finder",
          "type": "Project",
          "date": "Feb 2018"
        }
      ]
    }
  ]
}